# The FDR contact list

## 0. set-up. necessary files

In [66]:
import pandas as pd
from datetime import datetime

In [ ]:
# Specify the path to your Excel file
file_path = "data/fake_contact_list.xls"
# Use the read_excel function to read the Excel file into a DataFrame
df = pd.read_excel(file_path); df

In [90]:
# Extract the month, day, and year
df['month'] = df['Birthday'].str[:2]
df['day'] = df['Birthday'].str[2:4]
df['year'] = '2000'

# Create a new DataFrame with the extracted columns
new_df = df[['month', 'day', 'year']]; new_df

   month  day  year
0    NaN  NaN  2000
1    NaN  NaN  2000
2    NaN  NaN  2000
3    NaN  NaN  2000
4    NaN  NaN  2000
5     09   05  2000
6     09   11  2000
7     06   02  2000
8     09   20  2000
9     10   19  2000
10    09   22  2000
11    07   08  2000
12   NaN  NaN  2000

In [91]:
#bdays = pd.to_datetime(df["Birthday"])
bdays = pd.to_datetime(new_df, errors = 'coerce')

Now, we're comparing the gathered dates with the current dates to get all birthdays during the same month.

In [92]:
# Get the current month and year
current_date = datetime.now()
current_month = current_date.month
current_year = current_date.year

In [93]:
bdays

0           NaT
1           NaT
2           NaT
3           NaT
4           NaT
5    2000-09-05
6    2000-09-11
7    2000-06-02
8    2000-09-20
9    2000-10-19
10   2000-09-22
11   2000-07-08
12          NaT
dtype: datetime64[ns]

In [ ]:

# Filter the DataFrame to get rows with the same month as the present time
same_month_rows = df[bdays.dt.month == current_month]; same_month_rows

In [107]:
names_str = ', '.join( list(same_month_rows["First Name"]) )
month_data = same_month_rows[["First Name", "Last Name", "day", "month"]]

In [106]:
month_data

     First Name  Last Name day month
5         Pablo   Zorrilla  05    09
6          Hugo        NaN  11    09
8         Diego  Felgueres  20    09
10  Ana Beatriz      Souza  22    09

In [ ]:
names_str